recept/src/Documents/КоррекцияОстатков/КоррекцияОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КоррекцияОстатков</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коррекция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/AccumulationRegisters/ОстаткиМатериалов/ОстаткиМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМатериалов</name>
  <resources>
    <name>Остаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/Documents/КоррекцияОстатков/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
		Движение = Движения.ОстаткиМатериалов. Добавить();
		
		Если ТекСтрокаМатериалы.Коррекция > 0 Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Остаток = ТекСтрокаМатериалы.Коррекция;
		Иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход; 
			Движение.Остаток = - ТекСтрокаМатериалы.Коррекция;
		КонецЕсли;
		
		Движение.Период = Дата;
		Движение.Наименование = ТекСтрокаМатериалы.Номенклатура;
	КонецЦикла;

	
КонецПроцедуры
